package dao

import (
	"fmt"
	"testing"
	"updateLnineDownloadMorepic/models"
)

func TestNewComputerImgTag(t *testing.T) {
	bz:=models.BzSeoEcmsDownload{Softsay: "\n\t\t\t\t\t\t<p>企业QQ是一款非常好用的即时通讯工具，这个版本非常适合中小型企业使用，能够有效的帮助企业内外沟通交流，有效提高办公管理效率。<strong>企业QQ办公版</strong>软件，功能强大，能够同时支持同个号码，多人在线，通过科学的分配方式，实现高效办公服务，有利于提高企业售后团队形象。</p><p>企业QQ官方版软件，实时保存聊天记录，所有客户的聊天记录系统都会自动保存，方便企业管理者随时查看，能够起到监督作用，有利于提升服务质量。</p><h3>企业QQ特色</h3><p> 1.同一号码 多人在线</p><p>      一个企业QQ可由多个客服同时使用，通过科学分配方式实现高效客户服务;800靓号展示企业尊贵形象，是企业网络营销的身份象征</p><p>      2.十万好友 聊天不卡</p><p>      一个企业QQ可容纳10万好友，客户再多也装得下;同时在线聊天客户再多也不卡，客服轻松应对多个客户</p><p>      3.聊天记录 监控方便</p><p>      所有客户聊天记录在线保存，管理者可随时随地查看记录，监督客服工作，提升服务质量</p><p>      4.群发消息 主动营销</p><p>      可向海量好友群发消息，可控性高，针对性强，直接快速高效，投入小，收益大</p><img src=\"http://img.lnine.net/up/2105/202105261653127271.jpg\" alt=\"企业QQ特色\"/><h3>企业QQ如何注册账号</h3><p>首先打开百度，在百度搜索栏输入企业QQ可以看到有腾讯官方也有腾讯的代理商，因为官方需要自助注册，比较麻烦。所以今天给大家介绍一下如何通过代理商注册。</p><p><img src=\"http://img.lnine.net/up/2105/202105261652255184.jpg\" alt=\"企业QQ如何注册账号1\"/></p><p>找到任何一家代理商，如果不确定是否是真正的代理商可以在官网查询其资质。</p><p><img src=\"http://img.lnine.net/up/2105/202105261652257217.jpg\" alt=\"企业QQ如何注册账号2\"/></p><p><img src=\"http://img.lnine.net/up/2105/202105261652254235.jpg\" alt=\"企业QQ如何注册账号3\"/></p><p>核实之后，如果没问题。那么我们可以直接咨询在线客服或者拨打咨询热线，客服会告诉您注册所需的材料以及费用。您需要做的就是把材料提供给他们，然后签合同，付款。好大功告成，只管等着他们把账号给您！</p><img src=\"http://img.lnine.net/up/2105/202105261652252529.jpg\" alt=\"企业QQ如何注册账号(1鸟)4\"/><h3>企业QQ常见问题</h3><p>企业QQ与QQ比较有何优势？</p><p>和普通QQ相比，企业QQ屏蔽了QQ与办公无关的娱乐业务，专为企业内部沟通需求，设计了树形组织架构、实时通讯录、企业邮箱等功能。与此同时，企业主也可实时审查企业内员工行为记录，满足管理需求。</p><p>企业QQ与个人QQ有什么区别？</p><p>1、企业QQ属于企业所有，由企业掌握主控权；</p><p>2、个人QQ属于个人，企业QQ可以显示公司名称，员工账号末位连号，更好地展示企业形象</p><p>3、企业QQ有更多的商务沟通功能、更加安全、更加稳定、服务更好；</p><p>4、企业QQ每个号码可以加1500个好友；</p><p>5、企业QQ号码可以建更大更多的群，个人QQ最多为500人群。</p><p>企业能用企业QQ干什么？适合哪些企业？</p><p>企业规模：企业QQ适用于各类不同规模的企业，既能满足数十人小微企业，也能支持最多3万大型集团。 沟通类型：企业QQ既适用于企业成员内部沟通，又适用于企业成员对外商务沟通。 管理范围：企业QQ既适用于企业的内部员工沟通管理，又适用于企业的对外商务沟通管理。</p>\n                    ",
		Title:"企业QQ最新版官方下载 v1.9.12 办公版"}
	newcontent:=ComputerImgTagNumber(bz)
	fmt.Println(newcontent)

}


